# 1. Write a Pandas program to create and display a one-dimensional array

In [9]:
import pandas as pd
array1=[1,2,3,4,5,6]
print(array1,"\n")
ser=pd.Series(array1)
print(ser)

[1, 2, 3, 4, 5, 6]

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

# .Write a Pandas program to add, subtract, multiply and divide two Pandas Series

In [8]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,8,6,4,5])
Ssum=s1+s2
Ssub=s1-s2
Sdiv=s2/s1
Spro=s1*s2

print("The sum is:\n",Ssum)

print("The  difference is:\n",Ssub)

print("The product is:\n",Spro)

print("The quotients are:\n",Sdiv)

The sum is:
 0    11
1    10
2     9
3     8
4    10
dtype: int64
The  difference is:
 0   -9
1   -6
2   -3
3    0
4    0
dtype: int64
The product is:
 0    10
1    16
2    18
3    16
4    25
dtype: int64
The quotients are:
 0    10.0
1     4.0
2     2.0
3     1.0
4     1.0
dtype: float64

# write a panda program to create a single dataframe and save it as a csv file

In [15]:
import pandas as pd

diet={"weight":[55,40,60],"height":[155,160,165]}
df=pd.DataFrame(diet,index=["Durga","Eldhose","Savitha"])
print(df)
df.to_csv("prgm2.csv")

         weight  height
Durga        55     155
Eldhose      40     160
Savitha      60     165

# Write a Pandas program to create and display a DataFrame from a specified dictionary data
(10 records) 

which has the fields 1)name 2)Score 3)Attempts 4)Qualify

a)select the 'name' and ‘qualify’ columns from the following DataFrame
b)select the rows where the number of attempts in the examination is greater than 2
c)count the number of rows and columns of the DataFrame
d)Number of attempts in the examination is less than 2 and score greater than 10

e)select rows where score are missing

In [46]:
import pandas as pd
import numpy as np

data={"name":['a','b','c','d','e','f','g','h','i','j'],
      "Score":[10,20,np.nan,20,11,12,15,13,12,10],
     "qualify":["no","yes","yes","yes","no","no","yes","no","no","no"],
      "Attempts":[1,1,1,1,2,1,2,1,3,1]
     }
df2=pd.DataFrame(data)
print(df2,"\n")

#a)

print(df2[['name','qualify']],"\n")

#b)

print(df2[df2['Attempts']>2],"\n")

#c)

print("No.of rows:",len(df2.axes[0]),"\n")

print("No.of columns:",len(df2.axes[1]),"\n")

#d)

print(df2[(df2['Attempts']<2)&(df2['Score']>15)],"\n")

#e)

print(df2[df2['Score'].isnull()])

  name  Score qualify  Attempts
0    a   10.0      no         1
1    b   20.0     yes         1
2    c    NaN     yes         1
3    d   20.0     yes         1
4    e   11.0      no         2
5    f   12.0      no         1
6    g   15.0     yes         2
7    h   13.0      no         1
8    i   12.0      no         3
9    j   10.0      no         1

  name qualify
0    a      no
1    b     yes
2    c     yes
3    d     yes
4    e      no
5    f      no
6    g     yes
7    h      no
8    i      no
9    j      no

  name  Score qualify  Attempts
8    i   12.0      no         3

No.of rows: 10

No.of columns: 4

  name  Score qualify  Attempts
1    b   20.0     yes         1
3    d   20.0     yes         1

  name  Score qualify  Attempts
2    c    NaN     yes         1

# 5.Write a pandas program to create a dataframe(6 records) which has the fields id,name,age,degree,cgpa
a)insert a new column ‘class’ into the dataframe and populate values
b)Find out total no.of columns in the dataframe
c)select top 3 rows ,last 4 rows
d)delete all rows which have null values
e)drop ‘id’ column
f)select name,cgpa from 2 to 5 records
g)fill null values in the age column with mean value

In [34]:
import pandas as pd
import numpy as np

dict1={"id":[101,102,103,104,105,106],
      "name":["Lucy","Mary","Sam","Troy","Binu","Rakhi"],
      "age":[25,np.nan,22,23,22,22],
      "degree":["BCA","BCA","MCA","MCA","BCA","MCA"],
      "cgpa":[8.2,7.5,8.6,9.8,7.6,6.0],
      }
#print(dict1)
frame1=pd.DataFrame(dict1)
print(frame1,"\n\n")

#INSERTING NEW COLUMN "Class"

class1=["1st","2nd","3rd","1st","2nd","1st"]
frame1["class"]=class1
print(frame1,"\n")

#Printing no.of colums

print("Total no.of columns:",len(frame1.axes[1]),"\n")

#First 3 rows and last 4 rows

print("\nFirst 3 rows are:\n",frame1.head(n=3))
print("\nLast 4 rows are:\n",frame1.tail(n=4))

#delete rows with null values

frame1=frame1.dropna()
print("\nDataframe after deleting rows with null values:\n\n",frame1)


#dropping the column "id"

frame1=frame1.drop(columns=["id"])
print("\n Dataframe after dropping the id column:\n",frame1)

#name,cgpa from 2-5 records

print("\n",frame1.loc[2:5,['name','cgpa']],"\n")

#Filling the null values with the mean of ages

frame1.iloc[2:4,1:2]=np.nan
print(frame1)

mean_val=frame1['age'].mean()
print("\nThe mean is:",mean_val)

frame1.fillna(value=mean_val,axis=1,inplace=True)
print("\n Dataframe after filling null values with the mean:\n",frame1)

    id   name   age degree  cgpa
0  101   Lucy  25.0    BCA   8.2
1  102   Mary   NaN    BCA   7.5
2  103    Sam  22.0    MCA   8.6
3  104   Troy  23.0    MCA   9.8
4  105   Binu  22.0    BCA   7.6
5  106  Rakhi  22.0    MCA   6.0


    id   name   age degree  cgpa class
0  101   Lucy  25.0    BCA   8.2   1st
1  102   Mary   NaN    BCA   7.5   2nd
2  103    Sam  22.0    MCA   8.6   3rd
3  104   Troy  23.0    MCA   9.8   1st
4  105   Binu  22.0    BCA   7.6   2nd
5  106  Rakhi  22.0    MCA   6.0   1st

Total no.of columns: 6


First 3 rows are:
     id  name   age degree  cgpa class
0  101  Lucy  25.0    BCA   8.2   1st
1  102  Mary   NaN    BCA   7.5   2nd
2  103   Sam  22.0    MCA   8.6   3rd

Last 4 rows are:
     id   name   age degree  cgpa class
2  103    Sam  22.0    MCA   8.6   3rd
3  104   Troy  23.0    MCA   9.8   1st
4  105   Binu  22.0    BCA   7.6   2nd
5  106  Rakhi  22.0    MCA   6.0   1st

Dataframe after deleting rows with null values:

     id   name   age degree  cgpa class
0  101   Lucy  25.0    BCA   8.2   1st
2  103    Sam  22.0    MCA   8.6   3rd
3  104   Troy  23.0    MCA   9.8   1st
4  105   Binu  22.0    BCA   7.6   2nd
5  106  Rakhi  22.0    MCA   6.0   1st

 Dataframe after dropping the id column:
     name   age degree  cgpa class
0   Lucy  25.0    BCA   8.2   1st
2    Sam  22.0    MCA   8.6   3rd
3   Troy  23.0    MCA   9.8   1st
4   Binu  22.0    BCA   7.6   2nd
5  Rakhi  22.0    MCA   6.0   1st

     name  cgpa
2    Sam   8.6
3   Troy   9.8
4   Binu   7.6
5  Rakhi   6.0

    name   age degree  cgpa class
0   Lucy  25.0    BCA   8.2   1st
2    Sam  22.0    MCA   8.6   3rd
3   Troy   NaN    MCA   9.8   1st
4   Binu   NaN    BCA   7.6   2nd
5  Rakhi  22.0    MCA   6.0   1st

The mean is: 23.0

 Dataframe after filling null values with the mean:
     name   age degree cgpa class
0   Lucy  25.0    BCA  8.2   1st
2    Sam  22.0    MCA  8.6   3rd
3   Troy  23.0    MCA  9.8   1st
4   Binu  23.0    BCA  7.6   2nd
5  Rakhi  22.0    MCA  6.0   1st

In [40]:
print(frame1.axes[1])

Index(['name', 'age', 'degree', 'cgpa', 'class'], dtype='object')